rs-online/app/controllers/histories_controller.rb

SELECT * FROM "histories"
---
  def index
    @histories = History.all