rs-online/app/controllers/packages_controller.rb

  def index
    @packages = Package.all
---
SELECT * FROM "packages"

  def show
    @package = Package.find(params[:id])
    @links = Link.find(:all, :joins => :status, :conditions => ["package_id = ?", @package.id])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 2)
SELECT * FROM "links" WHERE (package_id = 6)

  def edit
    @package = Package.find(params[:id], :joins => :priority)
---
SELECT * FROM "packages" WHERE ("packages"."id" = 2)

  def create
    @package = Package.new(params[:package])
    @package.show = true
    @package.completed = false
    @package.problem = false

    @package.priority = Priority.find(params[:package_priority].to_i)
    # logger.debug @package
    links = []
    @package.s_links.each { |linha| links.push linha.chomp }
---
SELECT * FROM "priorities" WHERE ("priorities"."id" = -611272678)
INSERT INTO "links" ("package_id", "size", "created_at", "completed", "updated_at", "url", "date_started", "filename", "date_finished") VALUES(1, NULL, '2011-01-17 17:51:16.448032', NULL, '2011-01-17 17:51:16.448032', E'http://warez-bb.org/dexter.s01/ep.01.avi', NULL, NULL, NULL) RETURNING "id"
INSERT INTO "packages" ("comment", "pass_phrase", "url_source", "created_at", "completed", "priority_id", "updated_at", "date_started", "show", "date_finished", "description", "problem", "use_ip", "date_created") VALUES(E'season 01 de the walking dead.', E'', E'http://www.cpturbo.org/cpt/index.php?showtopic=261476&st=0&p=2790791&hl=walking%20dead&fromsearch=1&#entry2790791', '2011-01-18 20:40:18.289150', NULL, 3, '2011-01-18 20:40:18.289150', NULL, NULL, NULL, E'the.walking.dead.s01', NULL, 't', NULL) RETURNING "id"

  def update
    @package = Package.find(params[:id])

    respond_to do |format|
      if @package.update_attributes(params[:package])
---
SELECT * FROM "packages" WHERE ("packages"."id" = 2)
UPDATE "packages" SET "updated_at" = '2011-01-15 18:55:29.593881', "url_subtitle" = E'', "pass_phrase" = E'yousuck', "comment" = E'' WHERE "id" = 2

  def append_link
    url = params[:link]
    @link = Link.new()
    @link.url = url[:url]
    @link.package = Package.find(params[:package_id])
    @link.save()
---
SELECT * FROM "links" WHERE (package_id = E'2')
SELECT * FROM "packages" WHERE ("packages"."id" = 2)
INSERT INTO "links" ("package_id", "size", "created_at", "completed", "updated_at", "url", "date_started", "date_finished") VALUES(2, NULL, '2011-01-21 00:11:33.989227', NULL, '2011-01-21 00:11:33.989227', E'http://www.megaupload.com/?d=3CN18XUA', NULL, NULL) RETURNING "id"